<template>
  <div class="p-12px text-left flex flex-col items-center">
    <div class="mb-10px w-12/12">
      <b>文本折叠组件</b>
      <ul class="text-left w-12/12">
        <li>1.限制行数可配置</li>
        <li>2.展开/收起操作区域交互样式可自定义</li>
      </ul>
    </div>
    <div>
      <b>案例一：基本用法</b>
      <div class="border-1px mb-10px">
        <TextFold
          class="text-left leading-20px"
          :line="3"
          :text="`文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件`"
        ></TextFold>
      </div>
    </div>
    <div>
      <b>案例二：自定义插槽位置</b>
      <div class="border-1px">
        <TextFold class="text-left leading-20px" v-model="fold" :line="3">
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件 文本折叠组件
          文本折叠组件 文本折叠组件
          <template #toggle="{ foldState }">
            <div
              class="w-10px h-20px leading-20px from-transparent to-white bg-gradient-to-r"
            ></div>
            <div class="bg-white">自定义插槽{{ foldState }}</div>
          </template>
        </TextFold>
      </div>
    </div>
  </div>
</template>
<script setup>
import "@dss/vuecoms/assets/style.css";
import { TextFold } from "@dss/vuecoms";
import { ref } from "vue";

const fold = ref(true);
</script>

<style></style>
